### Exercício 01 – Operações com Pandas
a) Abra o arquivo World Happiness.

In [9]:
# Caminho para o arquivo;

import pandas as pd

path = 'C:\\Users\\FIC\OneDrive\\Documentos\\Jose Mauro_Python\\Arquivos\\'

file = 'world_happiness_report_2015.csv'

# Abrir o arquivo 

df = pd.read_csv(path + file)

#Cabeçalhos do Dataframe

df.head()

,country,region,happiness rank,happiness score,standard error,economy (GDP per Capita),family,health (Life Expectancy),freedom,trust (Government Corruption),generosity,dystopia residual
0,Switzerland,Western Europe,1,7.587,0.03411,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738
1,Iceland,Western Europe,2,7.561,0.04884,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201
2,Denmark,Western Europe,3,7.527,0.03328,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204
3,Norway,Western Europe,4,7.522,0.03880,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531
4,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176

### b) Qual a média do score_felicidade?

In [10]:
df['happiness score'].mean()

5.424487179487179

### c) Qual a soma do PIB?

In [11]:
soma = df['economy (GDP per Capita)'].sum

print('A soma do PIB é', soma)

A soma do PIB é <bound method NDFrame._add_numeric_operations.<locals>.sum of 0      1.39651
1      1.30232
2      1.32548
3      1.45900
4      1.32629
        ...
159    0.22208
160    0.28665
161    0.66320
162    0.01530
163    0.20868
Name: economy (GDP per Capita), Length: 164, dtype: float64>

### d) Qual a soma do freedom e corrupção?

In [12]:
df[['freedom', 'trust (Government Corruption)']].sum()

freedom                          71.33320
trust (Government Corruption)    24.59645
dtype: float64

### e) Há dados duplicados? Quantos? Verifique quais são eles?

In [13]:
# Quantidade de elementos duplicados.
df.duplicated().sum()

6

In [14]:
# Quais são os registros duplicados?

df[df.duplicated() == True]

,country,region,happiness rank,happiness score,standard error,economy (GDP per Capita),family,health (Life Expectancy),freedom,trust (Government Corruption),generosity,dystopia residual
11,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176
12,Finland,Western Europe,6,7.406,0.03140,1.29025,1.31826,0.88911,0.64169,0.41372,0.23351,2.61955
13,Netherlands,Western Europe,7,7.378,0.02799,1.32944,1.28017,0.89284,0.61576,0.31814,0.47610,2.46570
14,Sweden,Western Europe,8,7.364,0.03157,1.33171,1.28907,0.91087,0.65980,0.43844,0.36262,2.37119
34,Oman,Middle East and Northern Africa,22,6.853,0.05335,1.36011,1.08182,0.76276,0.63274,0.32524,0.21542,2.47489
35,Venezuela,Latin America and Caribbean,23,6.810,0.06476,1.04424,1.25596,0.72052,0.42908,0.11069,0.05841,3.19131

### f) Verifique a quantidade de dados faltantes.

In [15]:
# Exibir a quantidade de informações nos campos da tabela

df.isnull().sum()

country                           0
region                            0
happiness rank                    0
happiness score                   8
standard error                    1
economy (GDP per Capita)          0
family                            0
health (Life Expectancy)          0
freedom                           0
trust (Government Corruption)     0
generosity                        0
dystopia residual                14
dtype: int64

### g) Crie um dataframe onde os valores faltantes de score_felicidade sejam substituidos po -9999

In [17]:
df.loc[:,['happiness score']] = df.loc[:,['happiness score']].fillna(-9999)

df.isnull().sum()

country                           0
region                            0
happiness rank                    0
happiness score                   0
standard error                    1
economy (GDP per Capita)          0
family                            0
health (Life Expectancy)          0
freedom                           0
trust (Government Corruption)     0
generosity                        0
dystopia residual                14
dtype: int64

### h) Quantas e quais são as regiões existentes nos dados?

In [20]:
# Calcula a quantidade de registros duplicados

df.region.duplicated().sum()

154

In [21]:
# Remove as duplicadas e insere um novo dataframe
df_region = df.region.drop_duplicates()

In [22]:
# Calcular a quantidade de regiões únicas

df_region.count()

10

In [23]:
# Quais são essas regioes

df_region

0                      Western Europe
4                       North America
8           Australia and New Zealand
10    Middle East and Northern Africa
15        Latin America and Caribbean
27                  Southeastern Asia
36         Central and Eastern Europe
43                       Eastern Asia
76                 Sub-Saharan Africa
84                      Southern Asia
Name: region, dtype: object

### i) Verifique a frequência dos dados segundo suas regiões. Qual a região com maior quantidade de dados? E a região com a menor quantidade?

In [24]:
df.region.value_counts()

Sub-Saharan Africa                 40
Central and Eastern Europe         29
Western Europe                     24
Latin America and Caribbean        23
Middle East and Northern Africa    21
Southeastern Asia                   9
Southern Asia                       7
Eastern Asia                        6
North America                       3
Australia and New Zealand           2
Name: region, dtype: int64

In [27]:
#-------------------------------------------------- Dataframe 01 - Exemplo

dados = {
        'ID': ['1','2','3','4','5'],
        'nome':['Ana','Barbara','Douglas','Lorenzo','Enzo'],
        'sobrenome': ['Silva','Mourão','Souza','Lopes','Mendes']
}

# Converter o dicionário em dataframe
df_1 = pd.DataFrame(dados,columns=['ID','nome','sobrenome'])

#-------------------------------------------------- Dataframe 02 - Exemplo
dados2 = {
        'ID': ['6','7','8','9','10'],
        'nome':['Eder','Lucas','Joana','Paulo','Bete'],
        'sobrenome': ['Junqueira','Tarrou','Liza','Oshio','Yuho']
}

#-------------------------------------------------- Dataframe 03 - Exemplo
notas = {
        'ID':['1','2','3','4','5','6','7','8','9','10'],
        'notas_id': [51,55,15,61,84,96,100,0,78,12]
}

#-------------------------------------------------- Dataframe 03 - Exemplo
notas = {
        'ID':['1','2','3','4','5','6','7','8','9','10'],
        'notas_id': [51,55,15,61,84,96,100,0,78,12]
}
df_notas = pd.DataFrame(notas,columns=['ID','notas_id'])

In [39]:
df_1.head()

  ID     nome sobrenome
0  1      Ana     Silva
1  2  Barbara    Mourão
2  3  Douglas     Souza
3  4  Lorenzo     Lopes
4  5     Enzo    Mendes

In [40]:
df_2.head()

  ID     nome sobrenome
0  1      Ana     Silva
1  2  Barbara    Mourão
2  3  Douglas     Souza
3  4  Lorenzo     Lopes
4  5     Enzo    Mendes

### Empilhar os dataframes 1 e 2

In [42]:
df_1_2 = pd.concat([df_1,df_2])

df_1_2

  ID     nome sobrenome
0  1      Ana     Silva
1  2  Barbara    Mourão
2  3  Douglas     Souza
3  4  Lorenzo     Lopes
4  5     Enzo    Mendes
0  1      Ana     Silva
1  2  Barbara    Mourão
2  3  Douglas     Souza
3  4  Lorenzo     Lopes
4  5     Enzo    Mendes

### Realizar a associação do ID, Nome, Sobrenome e Nptas(Merge)

In [43]:
df_final = pd.merge(df_1_2,df_notas,on = 'ID',how ='left')

###